[{"file": "2026-02-13_10.png", "date": "2026-02-13", "time": "10", "visibility_ft": 10.0, "conditions": "Closest 4ft piling at right and 11ft piling behind it are both clearly visible, but the 14ft/30ft pilings toward the left are only vague dark masses with no texture and the background quickly fades to blue. This matches conditions where only the 11ft piling is reliably visible beyond the nearest one."}, {"file": "2026-02-12_12.png", "date": "2026-02-12", "time": "12", "visibility_ft": 15.0, "conditions": "The closest 4 ft piling on the right is clear with good texture. The mid-right 11 ft piling appears only as a very faint, hazy silhouette with almost no detail, similar to or slightly worse than the 15 ft reference condition. Farther pilings and the bottom are not visible. This corresponds best to the 15 ft guideline where the 14 ft region/piling is only a hazy silhouette."}, {"file": "2026-02-11_12.png", "date": "2026-02-11", "time": "12", "visibility_ft": 5.0, "conditions": "Closest 4 ft piling at right edge is clear with texture. The 11 ft piling is only barely discernible as a very faint vertical shadow; the 14 ft and 30 ft pilings are essentially lost in haze. This matches conditions where only the nearest piling is clearly visible."}, {"file": "2026-02-10_12.png", "date": "2026-02-10", "time": "12", "visibility_ft": 15.0, "conditions": "Closest (4 ft) and 11 ft pilings are clear with good texture; the 14 ft piling on left is visible but somewhat hazy; 30 ft pilings in the background are only extremely faint as broad vertical shadows, less distinct than the 25 ft reference. This corresponds to conditions where the 14 ft piling is hazy and distant pilings are barely silhouettes."}, {"file": "2026-02-09_12.png", "date": "2026-02-09", "time": "12", "visibility_ft": 15.0, "conditions": "Closest 4 ft piling at right is sharp with clear texture. The 11 ft piling is visible but soft, and the 14 ft/30 ft pilings appear only as very faint hazy silhouettes with little to no detail. This corresponds to conditions where the 14 ft piling is a hazy silhouette and distant pilings are barely discernible."}, {"file": "2026-02-08_12.png", "date": "2026-02-08", "time": "12", "visibility_ft": 15.0, "conditions": "The 14 ft piling on the left and the right-hand pilings are visible with some structure but appear hazy, and the far 30 ft pilings are not clearly distinguished as separate silhouettes. This corresponds to conditions where the 14 ft piling is a hazy silhouette and farther structures fade out."}, {"file": "2026-02-07_12.png", "date": "2026-02-07", "time": "12", "visibility_ft": 15.0, "conditions": "Closest 4 ft piling on right is sharp with clear texture. The 11 ft and 14 ft+ pilings toward center/left are visible only as hazy silhouettes with little detail, similar to or slightly worse than the 25 ft reference where 30 ft pilings are still discernible. No clear view of farther 30 ft pilings or bottom. This corresponds best to the 15 ft guideline where the 14 ft piling is a faded silhouette."}]