[{"file": "2026-02-16_07.png", "date": "2026-02-16", "time": "07", "visibility_ft": 5.0, "conditions": "Closest 4 ft piling at right is sharp with clear texture. The 11 ft piling is barely distinguishable, and the 14 ft/30 ft pilings fade into the green haze as indistinct shapes. This matches conditions where only the nearest piling is really clear."}, {"file": "2026-02-15_12.png", "date": "2026-02-15", "time": "12", "visibility_ft": 10.0, "conditions": "Closest 4 ft piling on right is clear; 11 ft piling is barely discernible as a very hazy silhouette, and farther pilings are essentially lost in the green water. This aligns with conditions where only the 11 ft piling is marginally visible."}, {"file": "2026-02-14_12.png", "date": "2026-02-14", "time": "12", "visibility_ft": 10.0, "conditions": "Closest 4ft piling at right edge is sharp with clear texture. The 11ft piling is visible but somewhat hazy. The 14ft and 30ft pilings are either extremely faint or not discernible, indicating the clear range does not reach them. This corresponds to conditions where only the 11ft piling is reliably visible."}, {"file": "2026-02-13_12.png", "date": "2026-02-13", "time": "12", "visibility_ft": 25.0, "conditions": "A sea lion is close to the camera but does not fully block the view. The nearest piling at ~4 ft on the right is sharp with clear texture. The 11 ft and 14 ft pilings are visible but hazy, lacking fine detail. The far 30 ft pilings are only faint silhouettes. This matches conditions where mid-distance pilings are hazy and distant ones are silhouettes, consistent with ~25 ft visibility."}, {"file": "2026-02-12_12.png", "date": "2026-02-12", "time": "12", "visibility_ft": 15.0, "conditions": "The closest 4 ft piling on the right is clear with good texture. The mid-right 11 ft piling appears only as a very faint, hazy silhouette with almost no detail, similar to or slightly worse than the 15 ft reference condition. Farther pilings and the bottom are not visible. This corresponds best to the 15 ft guideline where the 14 ft region/piling is only a hazy silhouette."}, {"file": "2026-02-11_12.png", "date": "2026-02-11", "time": "12", "visibility_ft": 5.0, "conditions": "Closest 4 ft piling at right edge is clear with texture. The 11 ft piling is only barely discernible as a very faint vertical shadow; the 14 ft and 30 ft pilings are essentially lost in haze. This matches conditions where only the nearest piling is clearly visible."}, {"file": "2026-02-10_12.png", "date": "2026-02-10", "time": "12", "visibility_ft": 15.0, "conditions": "Closest (4 ft) and 11 ft pilings are clear with good texture; the 14 ft piling on left is visible but somewhat hazy; 30 ft pilings in the background are only extremely faint as broad vertical shadows, less distinct than the 25 ft reference. This corresponds to conditions where the 14 ft piling is hazy and distant pilings are barely silhouettes."}]